JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1189/port_flexspi_pin.c
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"
#include "fsl_rgpio.h"
#include "mtu.h"
#include "mtu_pin.h"
#include "mtu_uart.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/////////////////////////////////////////////////////////////
enum _flexspi1_data_line_sel
{
    kFlexspi1_DataA_GPIO_B2_13_10      = 0x00,
    kFlexspi1_DataA_GPIO_B2_06_03      = 0x01,

    kFlexspi1_DataB_GPIO_SD_B2_11_08   = 0x10,
    kFlexspi1_DataB_GPIO_SD_B2_03_00   = 0x11,
    kFlexspi1_DataB_GPIO_B1_13_10      = 0x12,
    kFlexspi1_DataB_GPIO_B1_09_06      = 0x13,
};

enum _flexspi1_ss_b_sel
{
    kFlexspi1_Ss0A_GPIO_B2_09      = 0x00,

    kFlexspi1_Ss0B_GPIO_SD_B2_06   = 0x10,
    kFlexspi1_Ss0B_GPIO_B1_04      = 0x11,
};

enum _flexspi1_sclk_sel
{
    kFlexspi1_SclkA_GPIO_B2_08     = 0x00,

    kFlexspi1_SclkB_GPIO_SD_B2_07  = 0x10,
    kFlexspi1_SclkB_GPIO_B1_05     = 0x11,
};

enum _flexspi1_dqs_sel
{
    kFlexspi1_DqsA_GPIO_B2_07      = 0x00,

    kFlexspi1_DqsB_GPIO_SD_B2_05   = 0x10,
    kFlexspi1_DqsB_GPIO_B1_03      = 0x11,
};

/////////////////////////////////////////////////////////////
enum _flexspi2_data_line_sel
{
    kFlexspi2_DataA_GPIO_EMC_B1_38_35       = 0x00,
    kFlexspi2_DataA_GPIO_AON_27_24          = 0x01,

    kFlexspi2_DataB_GPIO_EMC_B1_33_30       = 0x10,
    kFlexspi2_DataB_GPIO_AON_18_15          = 0x11,
    kFlexspi2_DataB_GPIO_EMC_B1_25_22       = 0x12,
};

enum _flexspi2_ss_b_sel
{
    kFlexspi2_Ss0A_GPIO_EMC_B1_39   = 0x00,
    kFlexspi2_Ss0A_GPIO_AON_22      = 0x01,
    kFlexspi2_Ss1A_GPIO_EMC_B1_26   = 0x02,
    kFlexspi2_Ss1A_GPIO_AON_20      = 0x03,
    kFlexspi2_Ss1A_GPIO_AON_19      = 0x04,

    kFlexspi2_Ss0B_GPIO_EMC_B1_28   = 0x10,
    kFlexspi2_Ss0B_GPIO_AON_21      = 0x11,
    kFlexspi2_Ss1B_GPIO_EMC_B1_27   = 0x12,
};

enum _flexspi2_sclk_sel
{
    kFlexspi2_SclkA_GPIO_EMC_B1_41  = 0x00,
    kFlexspi2_SclkA_GPIO_AON_23     = 0x01,

    kFlexspi2_SclkB_GPIO_EMC_B1_34  = 0x10,
    kFlexspi2_SclkB_GPIO_AON_19     = 0x11,
};

enum _flexspi2_dqs_sel
{
    kFlexspi2_DqsA_GPIO_EMC_B1_40   = 0x00,
    kFlexspi2_DqsA_GPIO_AON_21      = 0x01,
    kFlexspi2_DqsA_GPIO_AON_28      = 0x02,

    kFlexspi2_DqsB_GPIO_EMC_B1_29   = 0x10,
    kFlexspi2_DqsB_GPIO_AON_20      = 0x11,
    kFlexspi2_DqsB_GPIO_AON_28      = 0x12,
    kFlexspi2_DqsB_GPIO_EMC_B1_21   = 0x13,
};

#if MTU_USE_MEM_DC_MUX
#define MTU_USE_MEM_DC_MUX1_FSPI2_PORTA           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 22, 0);            \
    }

#define MTU_USE_MEM_DC_MUX2_FSPI2_PORTA           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 22, 0);            \
    }

#define MTU_USE_MEM_DC_MUX1_FSPI2_PORTB           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 22, 1);            \
    }

#define MTU_USE_MEM_DC_MUX2_FSPI2_PORTB           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 22, 1);            \
    }

#define MTU_USE_MEM_DC_MUX3_FSPI2_PORTB           \
    {                                             \
        RGPIO_PinWrite(RGPIO4, 22, 1);            \
    }
#else
#define MTU_USE_MEM_DC_MUX1_FSPI2_PORTA  {}
#define MTU_USE_MEM_DC_MUX2_FSPI2_PORTA  {}
#define MTU_USE_MEM_DC_MUX1_FSPI2_PORTB  {}
#define MTU_USE_MEM_DC_MUX2_FSPI2_PORTB  {}
#define MTU_USE_MEM_DC_MUX3_FSPI2_PORTB  {}
#endif

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

   
/*******************************************************************************
 * Variables
 ******************************************************************************/

pin_info_t s_pinInfo[MTU_MAX_PINS];


/*******************************************************************************
 * Code
 ******************************************************************************/

void bsp_flexspi_pinmux_config(void *configPacket, bool isPintest)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc1);
    CLOCK_EnableClock(kCLOCK_Iomuxc2);

#if MTU_USE_EVK_SOCKET
    rgpio_pin_config_t do1_config = {kRGPIO_DigitalOutput, 0};
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_04_GPIO4_IO04, 0U);
    RGPIO_PinInit(RGPIO4, 4, &do1_config);
    RGPIO_PinWrite(RGPIO4, 4, 1);
#elif MTU_USE_MEM_DC_MUX
    rgpio_pin_config_t do1_config = {kRGPIO_DigitalOutput, 0};
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_23_GPIO4_IO23, 0U);
    RGPIO_PinInit(RGPIO4, 23, &do1_config);
    RGPIO_PinWrite(RGPIO4, 23, 0);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_22_GPIO4_IO22, 0U);
    RGPIO_PinInit(RGPIO4, 22, &do1_config);
    RGPIO_PinWrite(RGPIO4, 22, 0);
#endif

    if (isPintest)
    {
        pin_unittest_packet_t *packet = (pin_unittest_packet_t *)configPacket;
        rgpio_pin_config_t do_config = {kRGPIO_DigitalOutput, 0};
        memset(s_pinInfo, 0xFF, sizeof(s_pinInfo));
        if (packet->memConnection.instance == 1)
        {
            if (packet->unittestEn.option.B.dataLow4bit)
            {
                switch (packet->memConnection.dataLow4bit)
                {
                    case kFlexspi1_DataA_GPIO_B2_13_10:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_13_GPIO6_IO27, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_12_GPIO6_IO26, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_11_GPIO6_IO25, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_10_GPIO6_IO24, 0U);
                        RGPIO_PinInit(RGPIO6, 27, &do_config);
                        RGPIO_PinInit(RGPIO6, 26, &do_config);
                        RGPIO_PinInit(RGPIO6, 25, &do_config);
                        RGPIO_PinInit(RGPIO6, 24, &do_config);
                        s_pinInfo[0].gpioGroup = 6;
                        s_pinInfo[0].gpioPin = 27;
                        s_pinInfo[1].gpioGroup = 6;
                        s_pinInfo[1].gpioPin = 26;
                        s_pinInfo[2].gpioGroup = 6;
                        s_pinInfo[2].gpioPin = 25;
                        s_pinInfo[3].gpioGroup = 6;
                        s_pinInfo[3].gpioPin = 24;
                        break;
                    case kFlexspi1_DataB_GPIO_SD_B2_11_08:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_11_GPIO5_IO21, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_10_GPIO5_IO20, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_09_GPIO5_IO19, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_08_GPIO5_IO18, 0U);
                        RGPIO_PinInit(RGPIO5, 21, &do_config);
                        RGPIO_PinInit(RGPIO5, 20, &do_config);
                        RGPIO_PinInit(RGPIO5, 19, &do_config);
                        RGPIO_PinInit(RGPIO5, 18, &do_config);
                        s_pinInfo[0].gpioGroup = 5;
                        s_pinInfo[0].gpioPin = 21;
                        s_pinInfo[1].gpioGroup = 5;
                        s_pinInfo[1].gpioPin = 20;
                        s_pinInfo[2].gpioGroup = 5;
                        s_pinInfo[2].gpioPin = 19;
                        s_pinInfo[3].gpioGroup = 5;
                        s_pinInfo[3].gpioPin = 18;
                        break;
                    case kFlexspi1_DataB_GPIO_B1_13_10:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_13_GPIO6_IO13, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_12_GPIO6_IO12, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_11_GPIO6_IO11, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_10_GPIO6_IO10, 0U);
                        RGPIO_PinInit(RGPIO6, 13, &do_config);
                        RGPIO_PinInit(RGPIO6, 12, &do_config);
                        RGPIO_PinInit(RGPIO6, 11, &do_config);
                        RGPIO_PinInit(RGPIO6, 10, &do_config);
                        s_pinInfo[0].gpioGroup = 6;
                        s_pinInfo[0].gpioPin = 13;
                        s_pinInfo[1].gpioGroup = 6;
                        s_pinInfo[1].gpioPin = 12;
                        s_pinInfo[2].gpioGroup = 6;
                        s_pinInfo[2].gpioPin = 11;
                        s_pinInfo[3].gpioGroup = 6;
                        s_pinInfo[3].gpioPin = 10;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.ss_b)
            {
                switch (packet->memConnection.ss_b)
                {
                    case kFlexspi1_Ss0A_GPIO_B2_09:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_09_GPIO6_IO23, 0U);
                        RGPIO_PinInit(RGPIO6, 23, &do_config);
                        s_pinInfo[4].gpioGroup = 6;
                        s_pinInfo[4].gpioPin = 23;
                        break;
                    case kFlexspi1_Ss0B_GPIO_SD_B2_06:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_06_GPIO5_IO16, 0U);
                        RGPIO_PinInit(RGPIO5, 16, &do_config);
                        s_pinInfo[4].gpioGroup = 5;
                        s_pinInfo[4].gpioPin = 16;
                        break;
                    case kFlexspi1_Ss0B_GPIO_B1_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_04_GPIO6_IO04, 0U);
                        RGPIO_PinInit(RGPIO6, 4, &do_config);
                        s_pinInfo[4].gpioGroup = 6;
                        s_pinInfo[4].gpioPin = 4;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.sclk)
            {
                switch (packet->memConnection.sclk)
                {
                    case kFlexspi1_SclkA_GPIO_B2_08:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_08_GPIO6_IO22, 0U);
                        RGPIO_PinInit(RGPIO6, 22, &do_config);
                        s_pinInfo[5].gpioGroup = 6;
                        s_pinInfo[5].gpioPin = 22;
                        break;
                    case kFlexspi1_SclkB_GPIO_SD_B2_07:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_07_GPIO5_IO17, 0U);
                        RGPIO_PinInit(RGPIO5, 17, &do_config);
                        s_pinInfo[5].gpioGroup = 5;
                        s_pinInfo[5].gpioPin = 17;
                        break;
                    case kFlexspi1_SclkB_GPIO_B1_05:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_05_GPIO6_IO05, 0U);
                        RGPIO_PinInit(RGPIO6, 5, &do_config);
                        s_pinInfo[5].gpioGroup = 6;
                        s_pinInfo[5].gpioPin = 5;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.dqs0)
            {
                switch (packet->memConnection.dqs0)
                {
                    case kFlexspi1_DqsA_GPIO_B2_07:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_07_GPIO6_IO21, 0U);
                        RGPIO_PinInit(RGPIO6, 21, &do_config);
                        s_pinInfo[6].gpioGroup = 6;
                        s_pinInfo[6].gpioPin = 21;
                        break;
                    case kFlexspi1_DqsB_GPIO_SD_B2_05:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_05_GPIO5_IO15, 0U);
                        RGPIO_PinInit(RGPIO5, 15, &do_config);
                        s_pinInfo[6].gpioGroup = 5;
                        s_pinInfo[6].gpioPin = 15;
                        break;
                    case kFlexspi1_DqsB_GPIO_B1_03:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_03_GPIO6_IO03, 0U);
                        RGPIO_PinInit(RGPIO6, 3, &do_config);
                        s_pinInfo[6].gpioGroup = 6;
                        s_pinInfo[6].gpioPin = 3;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.dataHigh4bit)
            {
                switch (packet->memConnection.dataHigh4bit)
                {
                    case kFlexspi1_DataA_GPIO_B2_06_03:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_06_GPIO6_IO20, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_05_GPIO6_IO19, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_04_GPIO6_IO18, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B2_03_GPIO6_IO17, 0U);
                        RGPIO_PinInit(RGPIO6, 20, &do_config);
                        RGPIO_PinInit(RGPIO6, 19, &do_config);
                        RGPIO_PinInit(RGPIO6, 18, &do_config);
                        RGPIO_PinInit(RGPIO6, 17, &do_config);
                        s_pinInfo[7].gpioGroup = 6;
                        s_pinInfo[7].gpioPin = 20;
                        s_pinInfo[8].gpioGroup = 6;
                        s_pinInfo[8].gpioPin = 19;
                        s_pinInfo[9].gpioGroup = 6;
                        s_pinInfo[9].gpioPin = 18;
                        s_pinInfo[10].gpioGroup = 6;
                        s_pinInfo[10].gpioPin = 17;
                        break;
                    case kFlexspi1_DataB_GPIO_SD_B2_03_00:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_03_GPIO5_IO13, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_02_GPIO5_IO12, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_01_GPIO5_IO11, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_00_GPIO5_IO10, 0U);
                        RGPIO_PinInit(RGPIO5, 13, &do_config);
                        RGPIO_PinInit(RGPIO5, 12, &do_config);
                        RGPIO_PinInit(RGPIO5, 11, &do_config);
                        RGPIO_PinInit(RGPIO5, 10, &do_config);
                        s_pinInfo[7].gpioGroup = 5;
                        s_pinInfo[7].gpioPin = 13;
                        s_pinInfo[8].gpioGroup = 5;
                        s_pinInfo[8].gpioPin = 12;
                        s_pinInfo[9].gpioGroup = 5;
                        s_pinInfo[9].gpioPin = 11;
                        s_pinInfo[10].gpioGroup = 5;
                        s_pinInfo[10].gpioPin = 10;
                        break;
                    case kFlexspi1_DataB_GPIO_B1_09_06:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_09_GPIO6_IO09, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_08_GPIO6_IO08, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_07_GPIO6_IO07, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_B1_06_GPIO6_IO06, 0U);
                        RGPIO_PinInit(RGPIO6, 9, &do_config);
                        RGPIO_PinInit(RGPIO6, 8, &do_config);
                        RGPIO_PinInit(RGPIO6, 7, &do_config);
                        RGPIO_PinInit(RGPIO6, 6, &do_config);
                        s_pinInfo[7].gpioGroup = 6;
                        s_pinInfo[7].gpioPin = 9;
                        s_pinInfo[8].gpioGroup = 6;
                        s_pinInfo[8].gpioPin = 8;
                        s_pinInfo[9].gpioGroup = 6;
                        s_pinInfo[9].gpioPin = 7;
                        s_pinInfo[10].gpioGroup = 6;
                        s_pinInfo[10].gpioPin = 6;
                        break;
                    default:
                        break;
                }
            }
        }
        else if (packet->memConnection.instance == 2)
        {
            if (packet->unittestEn.option.B.dataLow4bit)
            {
                switch (packet->memConnection.dataLow4bit)
                {
                    case kFlexspi2_DataA_GPIO_EMC_B1_38_35:
                        MTU_USE_MEM_DC_MUX1_FSPI2_PORTA
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_38_GPIO3_IO06, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_37_GPIO3_IO05, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_36_GPIO3_IO04, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_35_GPIO3_IO03, 0U);
                        RGPIO_PinInit(RGPIO3, 6, &do_config);
                        RGPIO_PinInit(RGPIO3, 5, &do_config);
                        RGPIO_PinInit(RGPIO3, 4, &do_config);
                        RGPIO_PinInit(RGPIO3, 3, &do_config);
                        s_pinInfo[0].gpioGroup = 3;
                        s_pinInfo[0].gpioPin = 6;
                        s_pinInfo[1].gpioGroup = 3;
                        s_pinInfo[1].gpioPin = 5;
                        s_pinInfo[2].gpioGroup = 3;
                        s_pinInfo[2].gpioPin = 4;
                        s_pinInfo[3].gpioGroup = 3;
                        s_pinInfo[3].gpioPin = 3;
                        break;
                    case kFlexspi2_DataA_GPIO_AON_27_24:
                        MTU_USE_MEM_DC_MUX2_FSPI2_PORTA
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_27_GPIO1_IO27, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_26_GPIO1_IO26, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_25_GPIO1_IO25, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_24_GPIO1_IO24, 0U);
                        RGPIO_PinInit(RGPIO1, 27, &do_config);
                        RGPIO_PinInit(RGPIO1, 26, &do_config);
                        RGPIO_PinInit(RGPIO1, 25, &do_config);
                        RGPIO_PinInit(RGPIO1, 24, &do_config);
                        s_pinInfo[0].gpioGroup = 1;
                        s_pinInfo[0].gpioPin = 27;
                        s_pinInfo[1].gpioGroup = 1;
                        s_pinInfo[1].gpioPin = 26;
                        s_pinInfo[2].gpioGroup = 1;
                        s_pinInfo[2].gpioPin = 25;
                        s_pinInfo[3].gpioGroup = 1;
                        s_pinInfo[3].gpioPin = 24;
                        break;
                    case kFlexspi2_DataB_GPIO_EMC_B1_33_30:
                        MTU_USE_MEM_DC_MUX1_FSPI2_PORTA
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_33_GPIO3_IO01, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_32_GPIO3_IO00, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_31_GPIO2_IO31, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_30_GPIO2_IO30, 0U);
                        RGPIO_PinInit(RGPIO3, 1, &do_config);
                        RGPIO_PinInit(RGPIO3, 0, &do_config);
                        RGPIO_PinInit(RGPIO2, 31, &do_config);
                        RGPIO_PinInit(RGPIO2, 30, &do_config);
                        s_pinInfo[0].gpioGroup = 3;
                        s_pinInfo[0].gpioPin = 1;
                        s_pinInfo[1].gpioGroup = 3;
                        s_pinInfo[1].gpioPin = 0;
                        s_pinInfo[2].gpioGroup = 2;
                        s_pinInfo[2].gpioPin = 31;
                        s_pinInfo[3].gpioGroup = 2;
                        s_pinInfo[3].gpioPin = 30;
                        break;
                    case kFlexspi2_DataB_GPIO_AON_18_15:
                        MTU_USE_MEM_DC_MUX2_FSPI2_PORTA
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_18_GPIO1_IO18, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_17_GPIO1_IO17, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_16_GPIO1_IO16, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_15_GPIO1_IO15, 0U);
                        RGPIO_PinInit(RGPIO1, 18, &do_config);
                        RGPIO_PinInit(RGPIO1, 17, &do_config);
                        RGPIO_PinInit(RGPIO1, 16, &do_config);
                        RGPIO_PinInit(RGPIO1, 15, &do_config);
                        s_pinInfo[0].gpioGroup = 1;
                        s_pinInfo[0].gpioPin = 18;
                        s_pinInfo[1].gpioGroup = 1;
                        s_pinInfo[1].gpioPin = 17;
                        s_pinInfo[2].gpioGroup = 1;
                        s_pinInfo[2].gpioPin = 16;
                        s_pinInfo[3].gpioGroup = 1;
                        s_pinInfo[3].gpioPin = 15;
                        break;
                    case kFlexspi2_DataB_GPIO_EMC_B1_25_22:
                        MTU_USE_MEM_DC_MUX3_FSPI2_PORTB
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_25_GPIO2_IO25, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_24_GPIO2_IO24, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_23_GPIO2_IO23, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_22_GPIO2_IO22, 0U);
                        RGPIO_PinInit(RGPIO2, 25, &do_config);
                        RGPIO_PinInit(RGPIO2, 24, &do_config);
                        RGPIO_PinInit(RGPIO2, 23, &do_config);
                        RGPIO_PinInit(RGPIO2, 22, &do_config);
                        s_pinInfo[0].gpioGroup = 2;
                        s_pinInfo[0].gpioPin = 25;
                        s_pinInfo[1].gpioGroup = 2;
                        s_pinInfo[1].gpioPin = 24;
                        s_pinInfo[2].gpioGroup = 2;
                        s_pinInfo[2].gpioPin = 23;
                        s_pinInfo[3].gpioGroup = 2;
                        s_pinInfo[3].gpioPin = 22;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.ss_b)
            {
                switch (packet->memConnection.ss_b)
                {
                    case kFlexspi2_Ss0A_GPIO_EMC_B1_39:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_39_GPIO3_IO07, 0U);
                        RGPIO_PinInit(RGPIO3, 7, &do_config);
                        s_pinInfo[4].gpioGroup = 3;
                        s_pinInfo[4].gpioPin = 7;
                        break;
                    case kFlexspi2_Ss0A_GPIO_AON_22:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_22_GPIO1_IO22, 0U);
                        RGPIO_PinInit(RGPIO1, 22, &do_config);
                        s_pinInfo[4].gpioGroup = 1;
                        s_pinInfo[4].gpioPin = 22;
                        break;
                    case kFlexspi2_Ss1A_GPIO_EMC_B1_26:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_26_GPIO2_IO26, 0U);
                        RGPIO_PinInit(RGPIO2, 26, &do_config);
                        s_pinInfo[4].gpioGroup = 2;
                        s_pinInfo[4].gpioPin = 26;
                        break;
                    case kFlexspi2_Ss1A_GPIO_AON_20:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_20_GPIO1_IO20, 0U);
                        RGPIO_PinInit(RGPIO1, 20, &do_config);
                        s_pinInfo[4].gpioGroup = 1;
                        s_pinInfo[4].gpioPin = 20;
                        break;
                    case kFlexspi2_Ss1A_GPIO_AON_19:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AON_19_GPIO1_IO19, 0U);
                        RGPIO_PinInit(RGPIO1, 19, &do_config);
                        s_pinInfo[4].gpioGroup = 1;
                        s_pinInfo[4].gpioPin = 19;
                        break;
                    case kFlexspi2_Ss0B_GPIO_EMC_B1_28:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_28_GPIO2_IO28, 0U);
                        RGPIO_PinInit(RGPIO2, 28, &do_config);
                        s_pinInfo[4].gpioGroup = 2;
                        s_pinInfo[4].gpioPin = 28;
                        break;
                    default:
                        break;
                }
            }
            if (packet->unittestEn.option.B.sclk)
            {
                switch (packet->memConnection.sclk)
                {
