JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1189/port_flexspi_pin.c
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_28_FLEXSPI2_BUS2BIT_B_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_28_FLEXSPI2_BUS2BIT_B_SS0_B, 0x0AU);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.sclk)
            {
                case kFlexspi2_SclkA_GPIO_EMC_B1_41:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_41_FLEXSPI2_BUS2BIT_A_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_41_FLEXSPI2_BUS2BIT_A_SCLK, 0x0AU);
                    break;
                case kFlexspi2_SclkA_GPIO_AON_23:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_23_FLEXSPI2_BUS2BIT_A_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_23_FLEXSPI2_BUS2BIT_A_SCLK, 0x0AU);
                    break;
                case kFlexspi2_SclkB_GPIO_EMC_B1_34:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_34_FLEXSPI2_BUS2BIT_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_34_FLEXSPI2_BUS2BIT_B_SCLK, 0x0AU);
                    break;
                case kFlexspi2_SclkB_GPIO_AON_19:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_19_FLEXSPI2_BUS2BIT_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_19_FLEXSPI2_BUS2BIT_B_SCLK, 0x0AU);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dqs0)
            {
                case kFlexspi2_DqsA_GPIO_EMC_B1_40:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_40_FLEXSPI2_BUS2BIT_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_40_FLEXSPI2_BUS2BIT_A_DQS, 0x0AU);
                    break;
                case kFlexspi2_DqsA_GPIO_AON_21:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_21_FLEXSPI2_BUS2BIT_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_21_FLEXSPI2_BUS2BIT_A_DQS, 0x0AU);
                    break;
                case kFlexspi2_DqsA_GPIO_AON_28:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_28_DUMMY_FLEXSPI2_BUS2BIT_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_28_DUMMY_FLEXSPI2_BUS2BIT_A_DQS, 0x0AU);
                    break;
                case kFlexspi2_DqsB_GPIO_EMC_B1_29:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_29_FLEXSPI2_BUS2BIT_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_29_FLEXSPI2_BUS2BIT_B_DQS, 0x0AU);
                    break;
                case kFlexspi2_DqsB_GPIO_AON_20:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_20_FLEXSPI2_BUS2BIT_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_20_FLEXSPI2_BUS2BIT_B_DQS, 0x0AU);
                    break;
                case kFlexspi2_DqsB_GPIO_AON_28:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_28_DUMMY_FLEXSPI2_BUS2BIT_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_28_DUMMY_FLEXSPI2_BUS2BIT_B_DQS, 0x0AU);
                    break;
                case kFlexspi2_DqsB_GPIO_EMC_B1_21:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_21_FLEXSPI2_BUS2BIT_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_21_FLEXSPI2_BUS2BIT_B_DQS, 0x0AU);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dataHigh4bit)
            {
                case kFlexspi2_DataB_GPIO_EMC_B1_33_30:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_33_FLEXSPI2_BUS2BIT_B_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_32_FLEXSPI2_BUS2BIT_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_31_FLEXSPI2_BUS2BIT_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_30_FLEXSPI2_BUS2BIT_B_DATA03, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_33_FLEXSPI2_BUS2BIT_B_DATA00, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_32_FLEXSPI2_BUS2BIT_B_DATA01, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_31_FLEXSPI2_BUS2BIT_B_DATA02, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_30_FLEXSPI2_BUS2BIT_B_DATA03, 0x0AU);
                    break;
                case kFlexspi2_DataB_GPIO_AON_18_15:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_18_FLEXSPI2_BUS2BIT_B_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_17_FLEXSPI2_BUS2BIT_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_16_FLEXSPI2_BUS2BIT_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_15_FLEXSPI2_BUS2BIT_B_DATA03, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_18_FLEXSPI2_BUS2BIT_B_DATA00, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_17_FLEXSPI2_BUS2BIT_B_DATA01, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_16_FLEXSPI2_BUS2BIT_B_DATA02, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_15_FLEXSPI2_BUS2BIT_B_DATA03, 0x0AU);
                    break;
                case kFlexspi2_DataB_GPIO_EMC_B1_25_22:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_25_FLEXSPI2_BUS2BIT_B_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_24_FLEXSPI2_BUS2BIT_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_23_FLEXSPI2_BUS2BIT_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_22_FLEXSPI2_BUS2BIT_B_DATA03, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_25_FLEXSPI2_BUS2BIT_B_DATA00, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_24_FLEXSPI2_BUS2BIT_B_DATA01, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_23_FLEXSPI2_BUS2BIT_B_DATA02, 0x0AU);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_22_FLEXSPI2_BUS2BIT_B_DATA03, 0x0AU);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.sclk_n)
            {
                case kFlexspi2_SclkB_GPIO_EMC_B1_34:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_34_FLEXSPI2_BUS2BIT_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_34_FLEXSPI2_BUS2BIT_B_SCLK, 0x0AU);
                    break;
                case kFlexspi2_SclkB_GPIO_AON_19:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_19_FLEXSPI2_BUS2BIT_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_19_FLEXSPI2_BUS2BIT_B_SCLK, 0x0AU);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dqs1)
            {
                case kFlexspi2_DqsB_GPIO_EMC_B1_29:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_29_FLEXSPI2_BUS2BIT_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_29_FLEXSPI2_BUS2BIT_B_DQS, 0x0AU);
                    break;
                case kFlexspi2_DqsB_GPIO_AON_20:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_20_FLEXSPI2_BUS2BIT_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_20_FLEXSPI2_BUS2BIT_B_DQS, 0x0AU);
                    break;
                case kFlexspi2_DqsB_GPIO_AON_28:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AON_28_DUMMY_FLEXSPI2_BUS2BIT_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AON_28_DUMMY_FLEXSPI2_BUS2BIT_B_DQS, 0x0AU);
                    break;
                case kFlexspi2_DqsB_GPIO_EMC_B1_21:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_21_FLEXSPI2_BUS2BIT_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_21_FLEXSPI2_BUS2BIT_B_DQS, 0x0AU);
                    break;
                default:
                    break;
            }
        }
    }
}

void bsp_flexspi_gpios_toggle(void)
{
    if (s_pinUnittestPacket.unittestEn.enableAdcSample)
    {
        uint8_t convValue = bsp_adc_get_conv_value();
        mtu_uart_sendhex(&convValue, sizeof(convValue));
    }
  
    RGPIO_Type *gpioBase[] = RGPIO_BASE_PTRS;
    for (uint32_t i = 0; i < sizeof(s_pinInfo) / sizeof(pin_info_t); i++)
    {
        if (s_pinInfo[i].gpioGroup != 0xFFFFu)
        {
            RGPIO_PortToggle(gpioBase[s_pinInfo[i].gpioGroup], 1u << s_pinInfo[i].gpioPin);
        }
    }
}

